* Namespace and DB Connection
#+begin_src clojure :session PDX_ECON
  (ns inlight.core
    (:require [incanter.core :as i]
              [incanter.excel :as ixl]
              [next.jdbc :as jdbc]
              [next.jdbc.result-set :as jdbcrs]
              [sqlingvo.core :as sql]
              [clojure.string :as str]
              [clojure.pprint :as pp]
              [oz.core :as oz])
    (:import java.sql.DriverManager))

  ;; Create H2 DB.
  (def db-cred {:dbtype "postgresql"
                :dbname "ECON"
                :host "127.0.0.1"
                :post "5432"
                :user "postgres"
                :password "ela8teD53"})

  (def db (jdbc/get-datasource db-cred))

  (def dbsql (sql/db :postgresql))
#+end_src

#+RESULTS:
: nil#'inlight.core/db-cred#'inlight.core/db#'inlight.core/dbsql
* Table creation--PDX Employment Wage & Salary Data
#+begin_src clojure :session PDX_ECON
  ;; REPL -- Import table of Portland Employment Wage & Salary Data
  (def table-pdx-earn (ixl/read-xls "../inlight/resources/public/portland-emphrsearn-all-transposed.xlsx"))

  ;; Convert column names to uppercase and keywords, zipping with data values.
  (def table-pdx-earn-maps
    (for [mx (i/matrix table-pdx-earn)]
      (zipmap (map keyword
                   (map str/lower-case
                        (map #(str/replace % "-" "_") (i/col-names table-pdx-earn))))
              mx)))
  ;; (take 2 table-pdx-earn-maps)

  ;; Convert Jave Date to String for table upload.
  (defn date-to-string [date] (.format (java.text.SimpleDateFormat. "MM/dd/YYY") date))
  (def table-pdx-earn-maps-strdate
    (map #(update-in % [:month] date-to-string) table-pdx-earn-maps))

  ;; Create earnings_portland table
  (jdbc/execute! db ["DROP TABLE IF EXISTS pdx_econ.earnings_portland;"])
  (def create-table-earnings-portland
    (sql/sql
     (sql/create-table dbsql :pdx_econ.earnings_portland
                       (sql/column :month :varchar :size 25)
                       (sql/column :manufacturing :float :size 25)
                       (sql/column :construction :float :size 25)
                       (sql/column :leisure_hospitality :float :size 25)
                       (sql/column :financial :float :size 25)
                       (sql/column :trade_transport_utility :float :size 25)
                       (sql/column :services_education_health :float :size 25)
                       (sql/column :information :float :size 25)
                       (sql/column :services_professional_business :float :size 25)
                       (sql/column :government :float :size 25)
                       (sql/column :other :float :size 25))))

  (jdbc/execute! db create-table-earnings-portland)

  (def insert-table-earnings-portland
  (sql/sql
    (sql/insert dbsql :pdx_econ.earnings_portland []
    (sql/values table-pdx-earn-maps-strdate))))

  (jdbc/execute! db insert-table-earnings-portland)

#+end_src

#+RESULTS:
: #'inlight.core/table-pdx-earn#'inlight.core/table-pdx-earn-maps#'inlight.core/date-to-string#'inlight.core/table-pdx-earn-maps-strdate[#:next.jdbc{:update-count 0}]#'inlight.core/create-table-earnings-portland[#:next.jdbc{:update-count 0}]#'inlight.core/insert-table-earnings-portland[#:next.jdbc{:update-count 129}]
* Table creation--PDX Unemployment
#+begin_src clojure :session PDX_ECON
  ;; REPL -- Import table of Portland Employment
  (def table-pdx-emp (ixl/read-xls "../inlight/resources/public/portland-employment.xlsx"))

  (def table-pdx-emp-maps
    (for [mx (i/matrix table-pdx-emp)]
      (zipmap (map keyword
                   (map str/lower-case
                        (map #(str/replace % "-" "_") (i/col-names table-pdx-emp))))
              mx)))

  ;; Change MONTH to string for table upload.
  (def table-pdx-emp-maps-strdate
    (map #(update-in % [:month] date-to-string) table-pdx-emp-maps))


  ;; Create employment_portland table
  (jdbc/execute! db ["DROP TABLE IF EXISTS pdx_econ.employment_portland;"])
  (def create-table-employment-portland
    (sql/sql
     (sql/create-table dbsql :pdx_econ.employment_portland
                       (sql/column :month :varchar :size 25)
                       (sql/column :labor_force :float :size 25)
                       (sql/column :employment :float :size 25)
                       (sql/column :unemployment :float :size 25)
                       (sql/column :unemployment_rate :float :size 25)
                       )))


  (jdbc/execute! db create-table-employment-portland)

  (def insert-table-employment-portland
  (sql/sql
    (sql/insert dbsql :pdx_econ.employment_portland []
    (sql/values table-pdx-emp-maps-strdate))))

  (jdbc/execute! db insert-table-employment-portland)
#+end_src

#+RESULTS:
: #'inlight.core/table-pdx-emp#'inlight.core/table-pdx-emp-maps#'inlight.core/table-pdx-emp-maps-strdate[#:next.jdbc{:update-count 0}]#'inlight.core/create-table-employment-portland[#:next.jdbc{:update-count 0}]#'inlight.core/insert-table-employment-portland[#:next.jdbc{:update-count 129}]
* SQL--join Earnings and Employment
#+begin_src sql :engine "postgresql" :database ECON :dbuser postgres :dbpassword postgres :session pdx_econ
  DROP TABLE IF EXISTS pdx_econ.earnings_employment_join;
  CREATE UNLOGGED TABLE pdx_econ.earnings_employment_join as (
  SELECT TO_DATE(ea.month, 'MM/DD/YYYY') as pdx_month, emp.unemployment_rate, ea.manufacturing, ea.construction, ea.leisure_hospitality, ea.financial, ea.trade_transport_utility, ea.services_education_health, ea.information, ea.services_professional_business, ea.government, ea.other
  FROM pdx_econ.earnings_portland as ea
  LEFT JOIN pdx_econ.employment_portland as emp
  ON ea.month = emp.month
  ORDER BY pdx_month desc
  );

  SELECT * FROM pdx_econ.earnings_employment_join limit 5;
#+end_src

#+RESULTS:
| DROP TABLE |                   |               |              |                     |           |                         |                           |             |                                |            |       |
|------------+-------------------+---------------+--------------+---------------------+-----------+-------------------------+---------------------------+-------------+--------------------------------+------------+-------|
| SELECT 129 |                   |               |              |                     |           |                         |                           |             |                                |            |       |
|  pdx_month | unemployment_rate | manufacturing | construction | leisure_hospitality | financial | trade_transport_utility | services_education_health | information | services_professional_business | government | other |
| 2020-09-01 |               7.7 |         119.9 |         75.5 |                89.8 |      70.6 |                   212.1 |                     174.3 |        24.6 |                          181.3 |      141.7 |  38.8 |
| 2020-08-01 |               9.1 |           120 |         79.2 |                90.9 |        70 |                   210.8 |                     169.3 |        24.4 |                          182.5 |      138.9 |  39.6 |
| 2020-07-01 |              11.2 |         120.8 |         76.7 |                89.4 |      69.5 |                   210.2 |                     167.8 |        24.3 |                          183.8 |      137.1 |  39.4 |
| 2020-06-01 |              11.8 |         121.2 |         76.7 |                84.8 |      69.2 |                   206.8 |                     167.8 |        24.6 |                          179.2 |      145.2 |  38.6 |
| 2020-05-01 |                14 |         118.3 |         74.7 |                62.4 |      68.1 |                   203.7 |                     164.5 |        23.9 |                            177 |      146.4 |    37 |

* SQL--Create YOY table
#+begin_src sql :engine "postgresql" :database ECON :dbuser postgres :dbpassword postgres :session pdx_econ
  DROP TABLE IF EXISTS pdx_econ.earnings_employment_12mo_lag;
  CREATE UNLOGGED TABLE pdx_econ.earnings_employment_12mo_lag as (
  SELECT pdx_month,
  unemployment_rate, LAG(unemployment_rate, 12) OVER (ORDER BY pdx_month) as unemployment_rate_12mo_lag,
  leisure_hospitality, LAG(leisure_hospitality, 12) OVER (ORDER BY pdx_month) as leisure_hospitality_12mo_lag,
  manufacturing, LAG(manufacturing, 12) OVER (ORDER BY pdx_month) as manufacturing_12mo_lag,
  construction, LAG(construction, 12) OVER (ORDER BY pdx_month) as construction_12mo_lag,
  other, LAG(other, 12) OVER (ORDER BY pdx_month) as other_12mo_lag,
  services_education_health, LAG(services_education_health, 12) OVER (ORDER BY pdx_month) as services_education_health_12mo_lag,
  financial, LAG(financial, 12) OVER (ORDER BY pdx_month) as financial_12mo_lag,
  services_professional_business, LAG(services_professional_business, 12) OVER (ORDER BY pdx_month) as services_professional_business_12mo_lag,
  trade_transport_utility, LAG(trade_transport_utility, 12) OVER (ORDER BY pdx_month) as trade_transport_utility_12mo_lag,
  information, LAG(information, 12) OVER (ORDER BY pdx_month) as information_12mo_lag,
  government, LAG(government, 12) OVER (ORDER BY pdx_month) as government_12mo_lag
  FROM pdx_econ.earnings_employment_join
  ORDER BY pdx_month desc
  );

  SELECT * FROM pdx_econ.earnings_employment_12mo_lag LIMIT 13;

  DROP TABLE IF EXISTS pdx_econ.earnings_employment_yoy_change;
  CREATE TABLE pdx_econ.earnings_employment_yoy_change as (
  SELECT pdx_month, unemployment_rate,
  (round(((unemployment_rate - unemployment_rate_12mo_lag)/unemployment_rate_12mo_lag)::numeric, 4) *100)::float as unemployment_rate_yoy_pct_change,
  (round(((leisure_hospitality - leisure_hospitality_12mo_lag)/leisure_hospitality_12mo_lag)::numeric, 4) *100)::float as leisure_hospitality_yoy_pct_change,
  (round(((manufacturing - manufacturing_12mo_lag)/manufacturing_12mo_lag)::numeric, 4) *100)::float as manufacturing_yoy_pct_change,
  (round(((construction - construction_12mo_lag)/construction_12mo_lag)::numeric, 4) *100)::float as construction_yoy_pct_change,
  (round(((other - other_12mo_lag)/other_12mo_lag)::numeric, 4) *100)::float as other_yoy_pct_change,
  (round(((services_education_health - services_education_health_12mo_lag)/services_education_health_12mo_lag)::numeric, 4) *100)::float as services_education_health_yoy_pct_change,
  (round(((financial - financial_12mo_lag)/financial_12mo_lag)::numeric, 4) *100)::float as financial_yoy_pct_change,
  (round(((services_professional_business - services_professional_business_12mo_lag)/services_professional_business_12mo_lag)::numeric, 4) *100)::float as services_professional_business_yoy_pct_change,
  (round(((trade_transport_utility - trade_transport_utility_12mo_lag)/trade_transport_utility_12mo_lag)::numeric, 4) *100)::float as trade_transport_utility_yoy_pct_change,
  (round(((information - information_12mo_lag)/information_12mo_lag)::numeric, 4) *100)::float as information_yoy_pct_change,
  (round(((government - government_12mo_lag)/government_12mo_lag)::numeric, 4) *100)::float as government_yoy_pct_change
  FROM pdx_econ.earnings_employment_12mo_lag
  ORDER BY pdx_month desc
  );

  SELECT * FROM pdx_econ.earnings_employment_yoy_change LIMIT 13;
#+end_src

#+RESULTS:
| DROP TABLE |                   |                                  |                                    |                              |                             |                        |                                          |                          |                                               |                                        |                            |                                    |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
|------------+-------------------+----------------------------------+------------------------------------+------------------------------+-----------------------------+------------------------+------------------------------------------+--------------------------+-----------------------------------------------+----------------------------------------+----------------------------+------------------------------------+-----------+--------------------+--------------------------------+-----------------------------------------+-------------------------+----------------------------------+-------------+----------------------+------------+---------------------|
| SELECT 129 |                   |                                  |                                    |                              |                             |                        |                                          |                          |                                               |                                        |                            |                                    |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
|  pdx_month | unemployment_rate |       unemployment_rate_12mo_lag |                leisure_hospitality | leisure_hospitality_12mo_lag |               manufacturing | manufacturing_12mo_lag |                             construction |    construction_12mo_lag |                                         other |                         other_12mo_lag |  services_education_health | services_education_health_12mo_lag | financial | financial_12mo_lag | services_professional_business | services_professional_business_12mo_lag | trade_transport_utility | trade_transport_utility_12mo_lag | information | information_12mo_lag | government | government_12mo_lag |
| 2020-09-01 |               7.7 |                              3.1 |                               89.8 |                        129.1 |                       119.9 |                  129.5 |                                     75.5 |                     78.2 |                                          38.8 |                                   42.8 |                      174.3 |                              183.8 |      70.6 |               73.8 |                          181.3 |                                   190.6 |                   212.1 |                            221.5 |        24.6 |                 26.2 |      141.7 |               147.7 |
| 2020-08-01 |               9.1 |                              3.7 |                               90.9 |                        131.4 |                         120 |                  130.2 |                                     79.2 |                     78.9 |                                          39.6 |                                   43.1 |                      169.3 |                              179.1 |        70 |               74.5 |                          182.5 |                                   191.6 |                   210.8 |                            222.1 |        24.4 |                 26.6 |      138.9 |               144.1 |
| 2020-07-01 |              11.2 |                              3.8 |                               89.4 |                        131.1 |                       120.8 |                  130.6 |                                     76.7 |                       78 |                                          39.4 |                                   43.1 |                      167.8 |                              177.4 |      69.5 |               74.3 |                          183.8 |                                   190.4 |                   210.2 |                            221.1 |        24.3 |                 26.2 |      137.1 |               145.4 |
| 2020-06-01 |              11.8 |                              3.8 |                               84.8 |                        130.2 |                       121.2 |                  129.9 |                                     76.7 |                     76.6 |                                          38.6 |                                   42.8 |                      167.8 |                              179.8 |      69.2 |               73.3 |                          179.2 |                                   189.6 |                   206.8 |                            219.3 |        24.6 |                 26.6 |      145.2 |               155.7 |
| 2020-05-01 |                14 |                              3.4 |                               62.4 |                        127.3 |                       118.3 |                  129.4 |                                     74.7 |                     75.5 |                                            37 |                                     43 |                      164.5 |                              182.3 |      68.1 |               73.1 |                            177 |                                   188.7 |                   203.7 |                            218.8 |        23.9 |                   27 |      146.4 |                 156 |
| 2020-04-01 |              14.2 |                              3.6 |                               54.2 |                        125.6 |                       121.8 |                  129.1 |                                     68.1 |                     74.1 |                                          35.5 |                                   42.8 |                      163.2 |                              185.2 |      68.7 |               72.8 |                            178 |                                   188.1 |                   199.5 |                              218 |        25.3 |                 26.3 |      150.8 |               155.4 |
| 2020-03-01 |               3.6 |                              4.1 |                              119.4 |                        123.4 |                         128 |                  129.1 |                                     76.7 |                     73.6 |                                          43.6 |                                   42.5 |                      186.4 |                              185.2 |      72.7 |               72.4 |                          187.2 |                                   186.8 |                   220.7 |                            217.5 |        27.9 |                 26.1 |      155.2 |               155.3 |
| 2020-02-01 |               3.5 |                              4.1 |                              122.9 |                        121.6 |                       128.6 |                  128.7 |                                     75.6 |                     72.1 |                                          43.2 |                                   42.2 |                      187.6 |                              184.3 |      72.6 |               72.4 |                          186.5 |                                   185.6 |                   220.8 |                            217.6 |        27.8 |                 26.2 |      155.5 |               154.4 |
| 2020-01-01 |               3.4 |                              4.2 |                              122.8 |                        121.8 |                       126.7 |                  128.5 |                                     73.3 |                     72.2 |                                          42.4 |                                   42.2 |                      185.9 |                              180.6 |        73 |               72.1 |                            186 |                                   184.7 |                   224.4 |                            221.3 |        27.6 |                 25.8 |      154.2 |               153.2 |
| 2019-12-01 |               2.8 |                              3.7 |                              125.7 |                        125.2 |                       129.1 |                  129.1 |                                     75.2 |                     73.8 |                                          41.9 |                                   42.2 |                      185.7 |                              182.6 |      74.5 |               72.6 |                          190.8 |                                   185.9 |                   228.2 |                            227.5 |        27.7 |                   26 |      155.6 |                 154 |
| 2019-11-01 |               2.9 |                              3.6 |                              123.5 |                        124.1 |                       128.8 |                  128.8 |                                     76.6 |                     74.6 |                                          42.4 |                                   42.4 |                        186 |                              183.9 |      74.3 |               72.7 |                          191.7 |                                   186.3 |                   224.7 |                            225.7 |        27.6 |                 26.2 |      155.6 |               154.8 |
| 2019-10-01 |                 3 |                              3.6 |                              125.9 |                        125.2 |                       128.8 |                  128.8 |                                     76.5 |                     75.3 |                                          42.4 |                                   42.5 |                      184.9 |                                183 |      74.4 |               72.8 |                            192 |                                   186.4 |                   223.3 |                            219.8 |        26.6 |                 25.9 |      154.9 |               152.4 |
| 2019-09-01 |               3.1 |                              3.5 |                              129.1 |                        127.5 |                       129.5 |                  128.8 |                                     78.2 |                     75.5 |                                          42.8 |                                   42.3 |                      183.8 |                                180 |      73.8 |               72.7 |                          190.6 |                                   185.8 |                   221.5 |                            218.6 |        26.2 |                 25.5 |      147.7 |               146.9 |
| DROP TABLE |                   |                                  |                                    |                              |                             |                        |                                          |                          |                                               |                                        |                            |                                    |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| SELECT 129 |                   |                                  |                                    |                              |                             |                        |                                          |                          |                                               |                                        |                            |                                    |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
|  pdx_month | unemployment_rate | unemployment_rate_yoy_pct_change | leisure_hospitality_yoy_pct_change | manufacturing_yoy_pct_change | construction_yoy_pct_change |   other_yoy_pct_change | services_education_health_yoy_pct_change | financial_yoy_pct_change | services_professional_business_yoy_pct_change | trade_transport_utility_yoy_pct_change | information_yoy_pct_change |          government_yoy_pct_change |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2020-09-01 |               7.7 |                           148.39 |                             -30.44 |                        -7.41 |                       -3.45 |                  -9.35 |                                    -5.17 |                    -4.34 |                                         -4.88 |                                  -4.24 |                      -6.11 |                              -4.06 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2020-08-01 |               9.1 |                           145.95 |                             -30.82 |                        -7.83 |                        0.38 |                  -8.12 |                                    -5.47 |                    -6.04 |                                         -4.75 |                                  -5.09 |                      -8.27 |                              -3.61 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2020-07-01 |              11.2 |                           194.74 |                             -31.81 |                         -7.5 |                       -1.67 |                  -8.58 |                                    -5.41 |                    -6.46 |                                         -3.47 |                                  -4.93 |                      -7.25 |                              -5.71 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2020-06-01 |              11.8 |                           210.53 |                             -34.87 |                         -6.7 |                        0.13 |                  -9.81 |                                    -6.67 |                    -5.59 |                                         -5.49 |                                   -5.7 |                      -7.52 |                              -6.74 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2020-05-01 |                14 |                           311.76 |                             -50.98 |                        -8.58 |                       -1.06 |                 -13.95 |                                    -9.76 |                    -6.84 |                                          -6.2 |                                   -6.9 |                     -11.48 |                              -6.15 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2020-04-01 |              14.2 |                           294.44 |                             -56.85 |                        -5.65 |                        -8.1 |                 -17.06 |                                   -11.88 |                    -5.63 |                                         -5.37 |                                  -8.49 |                       -3.8 |                              -2.96 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2020-03-01 |               3.6 |                            -12.2 |                              -3.24 |                        -0.85 |                        4.21 |                   2.59 |                                     0.65 |                     0.41 |                                          0.21 |                                   1.47 |                        6.9 |                              -0.06 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2020-02-01 |               3.5 |                           -14.63 |                               1.07 |                        -0.08 |                        4.85 |                   2.37 |                                     1.79 |                     0.28 |                                          0.48 |                                   1.47 |                       6.11 |                               0.71 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2020-01-01 |               3.4 |                           -19.05 |                               0.82 |                         -1.4 |                        1.52 |                   0.47 |                                     2.93 |                     1.25 |                                           0.7 |                                    1.4 |                       6.98 |                               0.65 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2019-12-01 |               2.8 |                           -24.32 |                                0.4 |                            0 |                         1.9 |                  -0.71 |                                      1.7 |                     2.62 |                                          2.64 |                                   0.31 |                       6.54 |                               1.04 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2019-11-01 |               2.9 |                           -19.44 |                              -0.48 |                            0 |                        2.68 |                      0 |                                     1.14 |                      2.2 |                                           2.9 |                                  -0.44 |                       5.34 |                               0.52 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2019-10-01 |                 3 |                           -16.67 |                               0.56 |                            0 |                        1.59 |                  -0.24 |                                     1.04 |                      2.2 |                                             3 |                                   1.59 |                        2.7 |                               1.64 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |
| 2019-09-01 |               3.1 |                           -11.43 |                               1.25 |                         0.54 |                        3.58 |                   1.18 |                                     2.11 |                     1.51 |                                          2.58 |                                   1.33 |                       2.75 |                               0.54 |           |                    |                                |                                         |                         |                                  |             |                      |            |                     |

* Visualize!
** Start Oz Server
#+begin_src clojure :session PDX_ECON
  (oz/start-server!)
#+end_src

#+RESULTS:
: #function[taoensso.sente/-start-chsk-router!/stop!--44320]

** Build plots
#+begin_src clojure :session PDX_ECON
  (def table-pdx-earn-emp-yoy (jdbc/execute! db ["SELECT * FROM pdx_econ.earnings_employment_yoy_change WHERE pdx_month > '12/31/2018'::date"]
                                             {:builder-fn jdbcrs/as-unqualified-lower-maps}))

  (def unemp-line-plot
    {:width 800
     :height 500
     :data {:values table-pdx-earn-emp-yoy}
     :encoding {:x {:field "pdx_month" :timeUnit "yearmonth"}
                :y {:field "unemployment_rate" :type "quantitative"}}
     :mark "line"})

  (oz/view! unemp-line-plot)
#+end_src

#+RESULTS:
: #'inlight.core/table-pdx-earn-emp-yoy#'inlight.core/unemp-line-plotnil
